while True:
    print("Який океан є найбільшим за площею на Землі?")
    print("1. Атлантичний")
    print("2. Індійський")
    print("3. Тихий")
    print("4. Північний Льодовитий")

    user_input = input("Введіть номер відповіді: ")

    if user_input in ['1', '2', '3', '4']:
        answer = int(user_input)
        break
    else:
        print("Ви ввели недопустиме значення. Виберіть 1, 2, 3 або 4.\n")

if answer == 3:
    print("Відповідь вірна! Тест завершено.")
else:
    print("Відповідь не вірна! Вірна відповідь 3. Тихий. Тест завершено.")